In [9]:
import pandas as pd

In [10]:
# A dataframe is very similar to a dictionary.
# Below is an example of dictionary as a dataframe
# Here, the keys are columns, and the different entries (or values for each person) are rows

In [189]:
people = {
     "first": ['Clark', 'Diana', 'Bruce'],
     "last": ["Kent", "Prince", "Wayne"],
     "email": ['clark@dailyplanet.com', 'diana@amazon.com', 'bruce@wayne.com']
 }

In [190]:
# In a dictionary, you can use a key to retrieve the series (or column of data) corresponding to the specific key

In [191]:
people['email']

['clark@dailyplanet.com', 'diana@amazon.com', 'bruce@wayne.com']

In [14]:
# Now, let's use the same dictionary as a DataFrame.
# We define a DataFrame by making a pd (or pandas) object with argument 'people', i.e. the dictionary

In [192]:
df = pd.DataFrame(people)

### ACCESSING SPECIFIC COLUMNS (OR SERIES)

In [193]:
# just like in dictionaries, you can use keys to return a specific column (or list of values); each of these lists is called a 'series' or a one-dimensional array
# to access a series, you can either write df['email'] or use dot notation, e.g. df.email
# The difference is that while dictionary returns a list, df returns an 'object'

In [194]:
df['email']

0    clark@dailyplanet.com
1         diana@amazon.com
2          bruce@wayne.com
Name: email, dtype: object

In [195]:
people['email']

['clark@dailyplanet.com', 'diana@amazon.com', 'bruce@wayne.com']

In [19]:
# If you want more than one column, or specific columns, you can also pass on a list of the labels and get them.  i.e. df[['last', 'email']]. 
# You need to use double brackets; if you do not, pandas will think that ['last', 'email'] is the label for one single series and hence return a key error. 
# You can check this by removing the double-brackets below.

In [196]:
df[['last', 'email']]

     last                  email
0    Kent  clark@dailyplanet.com
1  Prince       diana@amazon.com
2   Wayne        bruce@wayne.com

### ACCESSING SPECIFIC ROWS WITH LOC & ILOC

In [21]:
# to get specific rows, we use loc and iloc
# iloc stands for integer location
# Most people get confused between these two functions. The only difference you need to bother about is that while iloc uses numerical indices to access a value, loc uses label names.

In [197]:
df.iloc[1]

first               Diana
last               Prince
email    diana@amazon.com
Name: 1, dtype: object

In [23]:
# if we need multiple rows, we can pass on the row indices as a list

In [198]:
df.iloc[[0,1]]

   first    last                  email
0  Clark    Kent  clark@dailyplanet.com
1  Diana  Prince       diana@amazon.com

In [25]:
# iloc can also take a second argument. This will allow you to return specifc column or columns.
# Here too iloc accepts numerical indices; so, to return the correct column, you'll need to know its index.

In [199]:
df.iloc[[0,1], [0,2]]

   first                  email
0  Clark  clark@dailyplanet.com
1  Diana       diana@amazon.com

In [27]:
# Instead of numerical indices, loc allows us to access the data by their labels as mentioned in the dataframe
# By default, dataframes assign numerical indices to rows when creating a DatFrame. You can choose to replace this with a specific row later. But when we have numerical indices, loc uses this like a row label
# for columns, we can use actual dataframe labels.

In [200]:
df.loc[2] # Here, we are calling a specific row by referring to the row label, i.e. the numerical index

first              Bruce
last               Wayne
email    bruce@wayne.com
Name: 2, dtype: object

In [201]:
# Similar to iloc, if we want multiple rows or columns, we can pass a list.

df.loc[[0,1], ['first','email']]

   first                  email
0  Clark  clark@dailyplanet.com
1  Diana       diana@amazon.com

In [114]:
# You can also use slices to access a range of rows and columns
# As with slices, the slice is exclusive of the last number. So, a column slice of '0:3' will return columns 0, 1 and 2 (excluding 3); same for rows.

In [202]:
df

   first    last                  email
0  Clark    Kent  clark@dailyplanet.com
1  Diana  Prince       diana@amazon.com
2  Bruce   Wayne        bruce@wayne.com

In [203]:
df.iloc[0:2, 0:3]

   first    last                  email
0  Clark    Kent  clark@dailyplanet.com
1  Diana  Prince       diana@amazon.com

### DEFINING A CUSTOM INDEX INSTEAD OF DEFAULT NUMBERS IN FIRST COLUMN

In [204]:
# You can set any of the columns as the index for a dataset (instead ot the default numerical index)

df.set_index('email')

                       first    last
email
clark@dailyplanet.com  Clark    Kent
diana@amazon.com       Diana  Prince
bruce@wayne.com        Bruce   Wayne

In [205]:
# Such functions do not change the dataframe itself unless you explicitly ask it to. For example, all that the above function does is return a view of the data with the changes, while keeping the original dataframe untouched.
# This is helpful so that we do not inadvertantly make errors when using these functions.
# To make the changes to the original dataframe, we have to ask pandas to make the changes 'in place', like so:

df.set_index('email', inplace = True)

# Now, to access a particular row, we can use the loc function with the argument 'email' instead of a numerical index.

In [207]:
df.loc['clark@dailyplanet.com']

first    Clark
last      Kent
Name: clark@dailyplanet.com, dtype: object

In [208]:
# to reset index to use numerical indices, we can use 'reset_index'

df.reset_index(inplace=True)

In [209]:
df

                   email  first    last
0  clark@dailyplanet.com  Clark    Kent
1       diana@amazon.com  Diana  Prince
2        bruce@wayne.com  Bruce   Wayne

### FILTERING

In [210]:
# While loc and iloc allow us to access specific rows, they do not allow us to access rows conditionally; we need to have foreknowledge of which rows we want to acces, and what are their indices.
# To work around this, we need to use conditional filtering.

# The below is NOT an assingment statement; do note the '==' instead of '='
# What the statement does is test to truthfulness of the statement for each row.
# The output works like a filter mask. The value is True for rows that qualify (i.e. the column 'last' IS equal to 'Doe'), and False for rows that do not (i.e. the column 'last' is NOT equal to 'Doe')
# We can use this output for conditional filtering.

df['last'] == 'Prince'

0    False
1     True
2    False
Name: last, dtype: bool

In [211]:
# To use the above as a conditional filter, we assign it's output to a variable
# Be careful not to use 'filter' as a variable name as 'filter' is a reserved word in Python.

filt = (df['last'] =='Prince')

In [212]:
# With the filter assigned to a variable, we can pass it to the dataframe command to access the dataframe
# The dataframe that is returned will only include the rows that meet the filtering criteria

df[filt]

              email  first    last
1  diana@amazon.com  Diana  Prince

In [213]:
# The above returns the entire table for the specific rows, i.e. all the columns
# If we are interested in only specific columns, we can also use the filter in a loc function and speicfy the column we want.

df.loc[filt, 'email']

1    diana@amazon.com
Name: email, dtype: object

In [214]:
# We can also string together multiple filters by usin 'AND' and 'OR'
# But, do note that in Pandas, AND is & and OR is |
# So, to define a filter that tests for a row that has 'John' as the first name OR(i.e. '|') 'Doe' as the last name:
filt2 = ((df['first'] =='Clark') | (df['last'] == 'Wayne'))
df.loc[filt2, 'email']

0    clark@dailyplanet.com
2          bruce@wayne.com
Name: email, dtype: object

In [216]:
# You can similarly string together various conditions to make NOT filters as well.
# But an easier way is to just use the '~' before a filter to make it a NOT filter.
# In the below statement, the filter is anything that is NOT 'filt'

df.loc[~filt2, 'email']

1    diana@amazon.com
Name: email, dtype: object

### HOW TO UPDATE COLUMNS

In [217]:
# If you want to get a list of all the columns in a particular dataframe, you can do so by using the df.columns function

df.columns

Index(['email', 'first', 'last'], dtype='object')

In [43]:
# Now, if you want to change the column names, you can do so by a couple of methods:

In [226]:
# Method 1: Using the df.columns to summon up the list of all columns, and then assigning it to a list of desired column names.

df.columns = ['EMAIL', 'FIRST NAME', 'LAST_NAME'] # this will change all column names

In [227]:
# The renamed columns

df

                   EMAIL FIRST NAME LAST_NAME
0  clark@dailyplanet.com      Clark      Kent
1       diana@amazon.com      Diana    Prince
2        bruce@wayne.com      Bruce     Wayne

In [228]:
# Method 3: Using List comprehension

df.columns = [x.lower() for x in df.columns]

In [229]:
df

                   email first name last_name
0  clark@dailyplanet.com      Clark      Kent
1       diana@amazon.com      Diana    Prince
2        bruce@wayne.com      Bruce     Wayne

In [230]:
# Method 3: We can also use string methods (replace) to modify the column names
# Below, we are using this to replace 'spaces' with 'under_scores'.

df.columns = df.columns.str.replace(' ', '_')

In [225]:
# note how 'first name' has been replaced by 'first_name'

df

                   email first_name last_name
0  clark@dailyplanet.com      Clark      Kent
1       diana@amazon.com      Diana    Prince
2        bruce@wayne.com      Bruce     Wayne

In [231]:
# Method 4: We can also use the 'rename' function to pass a dictionary of the old and new column names.
# This method is particularly useful when you only want to rename specific columns

df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [232]:
df

                   email  first    last
0  clark@dailyplanet.com  Clark    Kent
1       diana@amazon.com  Diana  Prince
2        bruce@wayne.com  Bruce   Wayne

### HOW TO UPDATE A SINGLE CELL OR A ROW OF DATA

In [235]:
# You can update a specific cell by accessing it by the loc function and using it in an assignment statement.

df.loc[2, 'last'] = 'Bale'

In [236]:
df

                   email  first    last
0  clark@dailyplanet.com  Clark    Kent
1       diana@amazon.com  Diana  Prince
2        bruce@wayne.com  Bruce    Bale

In [237]:
# You can also update all values in a row by accessing the entire row using the loc function and assigning it to a list of desired values/

df.loc[2] = ['christian@wayne.com', 'Christian' ,'Bale']

In [238]:
df

                   email      first    last
0  clark@dailyplanet.com      Clark    Kent
1       diana@amazon.com      Diana  Prince
2    christian@wayne.com  Christian    Bale

In [239]:
# An alternate method is to use the 'at' command. 

df.at[2, 'last'] = 'Wayne'

In [240]:
df

                   email      first    last
0  clark@dailyplanet.com      Clark    Kent
1       diana@amazon.com      Diana  Prince
2    christian@wayne.com  Christian   Wayne

In [52]:
# Do note that you cannot change values in cells by filtering. You will get an index error. Try it.

### HOW TO UPDATE AN ENTIRE COLUMN OR MULTIPLE ROWS

In [241]:
# Suppose you wanted to convert all the email IDs to lower case. You can do this by first accessing the 'email' column, and then using a string method (lower) on it.

df['email'].str.lower()

0    clark@dailyplanet.com
1         diana@amazon.com
2      christian@wayne.com
Name: email, dtype: object

In [242]:
# However, this will not change the original dataframe. To commit the changes to the original dataframe, you'll need to use an assignment function, like so: 

df['email'] = df['email'].str.lower()

In [243]:
df

                   email      first    last
0  clark@dailyplanet.com      Clark    Kent
1       diana@amazon.com      Diana  Prince
2    christian@wayne.com  Christian   Wayne

In [57]:
# There are some functions that use the 'in place' argument, and some that work with assignment. I know it's confusing. I've also not been able to figure out the difference. :P

# There are 4 more methods to do these changes:
# apply ---> to df and series
# applymap --> to entire df
# map ---> to series
# replace --> similar to map, but keeps other values intact

#### apply

In [146]:
# Can work on an entire dataframe or on a specific series
# apply works by allowing you to 'apply' a function to a dataframe or a series.
# You can either pass the function directly, define it beforehand, or use a lambda function.

In [244]:
# Here, we are passing the function directly to a series, i.e. 'email'.
# The function just returns the len of each cell in the series.

df['email'].apply(len)

0    21
1    16
2    19
Name: email, dtype: int64

In [245]:
# Here, we are first defining a function called 'update_email'. 
# All that the function does is converts stuff to upper case. 

def update_email(email):
    return email.upper()

# Once defined, we can use the function inside of an apply function, like so:

df['email'].apply(update_email)

0    CLARK@DAILYPLANET.COM
1         DIANA@AMAZON.COM
2      CHRISTIAN@WAYNE.COM
Name: email, dtype: object

In [246]:
# Here, we are doing exactly the same thing, except that instead of pre-defining the function, we are using a lambda function

df['email'].apply(lambda x: x.lower())

0    clark@dailyplanet.com
1         diana@amazon.com
2      christian@wayne.com
Name: email, dtype: object

In [63]:
# let's see how apply works on dataframes

In [247]:
df.apply(len)

# this just returns the number of entries in each row. But not to specific instances

email    3
first    3
last     3
dtype: int64

In [248]:
df.apply(len, axis = 'columns') 

# this returns number of entries in every column. But not to specific instances

0    3
1    3
2    3
dtype: int64

In [249]:
df.apply(pd.Series.min) 

# this returns the min value of each column; if column doesn't have a number, then it just picks the first entry alphabetically

email    christian@wayne.com
first              Christian
last                    Kent
dtype: object

In [250]:
df.apply(lambda x: x.min())

# exactly same as above, except using lambda function

email    christian@wayne.com
first              Christian
last                    Kent
dtype: object

#### applymap

In [251]:
# Applymap only works on dataframes. 
# Applies function to ALL entries in df

df.applymap(len)

   email  first  last
0     21      5     4
1     16      5     6
2     19      9     5

In [252]:
df.applymap(str.lower)

                   email      first    last
0  clark@dailyplanet.com      clark    kent
1       diana@amazon.com      diana  prince
2    christian@wayne.com  christian   wayne

#### map

In [253]:
# map only works on a series; used to substitite values in a series
# summon up the series using bracket notation, then pass on a dictionary
# for entries that are not mentioned, it will be replaced by Nan; if you don't want this, then use the REPLACE method instead

df['first'].map({'Clark': 'Christopher', 'Diana': 'Gal'})

0    Christopher
1            Gal
2            NaN
Name: first, dtype: object

#### replace

In [254]:
# similar to map, it works on a series;
# unlike map, for values that are not there in the dictionary that's passed to it, it retains the existing value. 

df['first'].replace({'Clark': 'Christoper', 'Diana': 'Gal'})

0    Christoper
1           Gal
2     Christian
Name: first, dtype: object

### ADDING AND REMOVING COLUMNS AND ROWS

#### ADDING COLUMNS

In [255]:
# You can add two columns by accessing them by bracket notation and adding them up.

df['full_name'] = df['first'] + ' '+ df['last']

In [256]:
df

                   email      first    last        full_name
0  clark@dailyplanet.com      Clark    Kent       Clark Kent
1       diana@amazon.com      Diana  Prince     Diana Prince
2    christian@wayne.com  Christian   Wayne  Christian Wayne

In [257]:
# You can remove columns by using the 'drop' function

df.drop(columns = ['first', 'last'], inplace= True) # like always, ahve to use inplace to change the actual df

In [258]:
df

                   email        full_name
0  clark@dailyplanet.com       Clark Kent
1       diana@amazon.com     Diana Prince
2    christian@wayne.com  Christian Wayne

In [259]:
# You can also run various operations on a column and use it to make newer columns.
# In example below, we are using the 'full_name' column, and splitting the entries on their 'space'; after that, we are assigning them to two new columns ('first', 'last')

df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

# In above, 'expand' ensures that the resulting splits are expanded to two new functions

In [260]:
df

                   email        full_name      first    last
0  clark@dailyplanet.com       Clark Kent      Clark    Kent
1       diana@amazon.com     Diana Prince      Diana  Prince
2    christian@wayne.com  Christian Wayne  Christian   Wayne

In [261]:
# You can also rearrange the sequence of columns by calling them to a list. 

df = df[['full_name', 'first', 'last', 'email']]

In [262]:
df

         full_name      first    last                  email
0       Clark Kent      Clark    Kent  clark@dailyplanet.com
1     Diana Prince      Diana  Prince       diana@amazon.com
2  Christian Wayne  Christian   Wayne    christian@wayne.com

#### ADDING ROWS

In [167]:
# We can add data row by row, or we can also add another dataframe to another dataframe

In [269]:
# adding single row of data

df = df.append({'first': 'Tony', 'last': 'Soprano'}, ignore_index= True)

In [270]:
df

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN

In [80]:
# adding one dataframe to another

In [271]:
# Let's first create a second dataframe

more_people = {
     "first": ['Endeavour', 'Saul'],
     "last": ['Morse', 'Goodman'],
     "email": ['morse@oxford.com', 'saul@lawyer.com']
 }

df2 = pd.DataFrame(more_people)

In [272]:
df2

       first     last             email
0  Endeavour    Morse  morse@oxford.com
1       Saul  Goodman   saul@lawyer.com

In [273]:
# Now, we can use the append function to append the new dataframe (df2) to the existing dataframe (df)
# We will call the resultant dataframe df3

df3 = df.append(df2, ignore_index= True)

# In the above, ignore_index = True ensures that the row indexes of df2 are not carried over to df3. Essentially, the new df will have fresh indexes.

In [274]:
df3

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

#### REMOVING ROWS

In [275]:
# You can remove a specific row by the drop function.
# The index is the index of the row to be removed.

df3.drop(index = 2)

      full_name      first     last                  email
0    Clark Kent      Clark     Kent  clark@dailyplanet.com
1  Diana Prince      Diana   Prince       diana@amazon.com
3           NaN       Tony  Soprano                    NaN
4           NaN  Endeavour    Morse       morse@oxford.com
5           NaN       Saul  Goodman        saul@lawyer.com

In [276]:
# To remove multiple rows that meet a certain condition, we need to first define a filter; this behaviour is different from when we wanted to add data to cells (in which case it wasn't possible via filter --> led to an index or key error)
# Then we can pass on the filter to the drop function, along with a call to the dot.index attribute

filt3 = df3['last'] == 'Soprano'

df3.drop(index = df[filt3].index)

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

#### SORTING DATA

In [277]:
# we can use the sort_values function to sort dataframe by a desired label/ column. The function takes the filter column as an argument.
# below, we are using the 'last' label to filter the dataframe

df3.sort_values(by='last')

         full_name      first     last                  email
5              NaN       Saul  Goodman        saul@lawyer.com
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
4              NaN  Endeavour    Morse       morse@oxford.com
1     Diana Prince      Diana   Prince       diana@amazon.com
3              NaN       Tony  Soprano                    NaN
2  Christian Wayne  Christian    Wayne    christian@wayne.com

In [278]:
# By default, sort is done in ascending order. If you need to reverse this, another argument needs to be passed. 

df3.sort_values(by='last', ascending = False)

         full_name      first     last                  email
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
1     Diana Prince      Diana   Prince       diana@amazon.com
4              NaN  Endeavour    Morse       morse@oxford.com
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [279]:
# You can also sort by multiple columns (one after the other) by passing a list to 'by:'
# If you want to sort one column by descending and one by ascending, you can similarly pass a list of boolean values to the 'ascending' argument. 

df3.sort_values(by = ['last', 'first'], ascending = [False, True])

         full_name      first     last                  email
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
1     Diana Prince      Diana   Prince       diana@amazon.com
4              NaN  Endeavour    Morse       morse@oxford.com
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [280]:
# to get back to original state where the indices are sorted

df3.sort_index()

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [281]:
# You can also sort a single series by calling it using the usual bracket notation and then using the sort_values() function

df3['last'].sort_values()

5    Goodman
0       Kent
4      Morse
1     Prince
3    Soprano
2      Wayne
Name: last, dtype: object

### CLEANING DATA

In [282]:
# Below is our latest dataframe. You'll notice that there are a lot of NaN values here. When doing analysis, you might want to clean the table up.
# NaN ---> 'Not a Number'

df3

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [283]:
# If you want to remove all rows that have NaN value from your dataframe, you can do so by using the dropna function

df3.dropna()

         full_name      first    last                  email
0       Clark Kent      Clark    Kent  clark@dailyplanet.com
1     Diana Prince      Diana  Prince       diana@amazon.com
2  Christian Wayne  Christian   Wayne    christian@wayne.com

In [284]:
# Instead of dropping rows, if you want to drop columns that have NaN value, you can do so by using the argument 'axis = 'columns''
# Below, the 'how' argument decides how pandas decides to drop a column. 'Any' means that a column that has ANY NaN value will be dropped. 

df3.dropna(axis = 'columns', how='any')

       first     last
0      Clark     Kent
1      Diana   Prince
2  Christian    Wayne
3       Tony  Soprano
4  Endeavour    Morse
5       Saul  Goodman

In [285]:
# Instead of 'any', if we pass 'all' to 'how', it will only drop columns that have ALL values as NaN; in our example, there is no such column; so nothing is dropped. 

df3.dropna(axis = 'columns', how='all')

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [286]:
# if we want to drop rows that have NaN only in a specific column, we can use argument called 'subset'
# In the below example, only the rows that have NaN in the full_name column will be dropped

df3.dropna(axis = 'index', how = 'all', subset = ['full_name'])

         full_name      first    last                  email
0       Clark Kent      Clark    Kent  clark@dailyplanet.com
1     Diana Prince      Diana  Prince       diana@amazon.com
2  Christian Wayne  Christian   Wayne    christian@wayne.com

### HANDLING CUSTOM MISSING VALUES

In [ ]:
# Depending on how you've sourced your data, sometimes some cells might have custom NaN values like 'missing' or 'na'. It's important to handle these so that your analysis doesn't go wonky.

In [287]:
# to replace a custom missing value with na, we can use the numpy function np.nan

import numpy as np

df3.replace('NA', np.nan)
df3.replace('MISSING', np.nan)

# In the below dataframe, this doesn't change anything because there were no cells with 'NA' or 'MISSING'. If there were, it would have changed to NaN

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3              NaN       Tony  Soprano                    NaN
4              NaN  Endeavour    Morse       morse@oxford.com
5              NaN       Saul  Goodman        saul@lawyer.com

In [288]:
# To quickly check which cells have NaN value, we can use the isna() function
# This returns a sort of mask value of NaN cells

df3.isna() # returns a mask of NA values.

   full_name  first   last  email
0      False  False  False  False
1      False  False  False  False
2      False  False  False  False
3       True  False  False   True
4       True  False  False  False
5       True  False  False  False

In [289]:
# We can also choose to fill ALL NaN cells with a custom value in one go using the fillna() function.

df3.fillna('MISSING')

         full_name      first     last                  email
0       Clark Kent      Clark     Kent  clark@dailyplanet.com
1     Diana Prince      Diana   Prince       diana@amazon.com
2  Christian Wayne  Christian    Wayne    christian@wayne.com
3          MISSING       Tony  Soprano                MISSING
4          MISSING  Endeavour    Morse       morse@oxford.com
5          MISSING       Saul  Goodman        saul@lawyer.com

In [290]:
# In order to carry out aggregate analysis, and derive useful values like mean, median, etc., it's important that you have data in the right 'type'. Else, the resultant aggregate values will be erroneous. 
# A quick way to find out data types is by using the dtypes attribute. 

df3.dtypes

full_name    object
first        object
last         object
email        object
dtype: object

In [291]:
# Sometimes strings might look like int in a dataframe. In order to extract aggregate data, you need to convert to int or float. 
# if it has missing values, you need to convert to float since NaN is actually a float data-type
# Here's how you can change data-type for a particular column

df3['email'].astype(str) # this will convert the specific column to string

0    clark@dailyplanet.com
1         diana@amazon.com
2      christian@wayne.com
3                      nan
4         morse@oxford.com
5          saul@lawyer.com
Name: email, dtype: object

### NUMERICAL OPERATIONS

In [359]:
# Pandas allows you to do a lot of numerical operations.
# But for that, let's first create some numerical data. Then we will play around with it. 

people = {
     "first": ['Clark', 'Diana', 'Bruce', 'Endeavour', 'Tony', 'Saul'],
     "last": ["Kent", "Prince", "Wayne", 'Morse', 'Soprano', 'Goodman'],
     "age": ['37', '35', '46', '40', '61', '57'],
     "physical_strength": ['90', '88', '70', '20', '45', '35'],
     "mental_acuity": ['75', '80', '85', '95', '60', '90'],
     "height": ['193', '178', '183', '177', '186', '175'],
     "person_type": ['Super', 'Super', 'Super', 'Human', 'Human', 'Human'],
     "alive": ['Yes', 'Yes', 'Yes', 'No', 'No', 'Yes']
 }

df4 = pd.DataFrame(people)

# Do note that we are defining the above DataFrame via a dictionary by choice; easier way to do this would be to make the table in excel, save it as csv, and then import it to pandas. Command for that would be df4 = pd.read_csv('<filename>'). Here, we are assuming that the CSV file is in the same folder as your current working file. If not, you will also need to include relative path to the file.

In [360]:
df4

,first,last,age,physical_strength,mental_acuity,height,person_type,alive
0,Clark,Kent,37,90,75,193,Super,Yes
1,Diana,Prince,35,88,80,178,Super,Yes
2,Bruce,Wayne,46,70,85,183,Super,Yes
3,Endeavour,Morse,40,20,95,177,Human,No
4,Tony,Soprano,61,45,60,186,Human,No
5,Saul,Goodman,57,35,90,175,Human,Yes

In [361]:
# shape returns the number of rows and columns in a df

df4.shape

(6, 8)

In [362]:
# info returns a list of all column labels and the data types

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   first              6 non-null      object
 1   last               6 non-null      object
 2   age                6 non-null      object
 3   physical_strength  6 non-null      object
 4   mental_acuity      6 non-null      object
 5   height             6 non-null      object
 6   person_type        6 non-null      object
 7   alive              6 non-null      object
dtypes: object(8)
memory usage: 512.0+ bytes

In [363]:
# head and tail return the first 5 and last 5 rows
# you can also pass an argument (e.g. df.head(50)) to return a specific number

df4.head()

,first,last,age,physical_strength,mental_acuity,height,person_type,alive
0,Clark,Kent,37,90,75,193,Super,Yes
1,Diana,Prince,35,88,80,178,Super,Yes
2,Bruce,Wayne,46,70,85,183,Super,Yes
3,Endeavour,Morse,40,20,95,177,Human,No
4,Tony,Soprano,61,45,60,186,Human,No

In [364]:
# to get a list of all the columns in the dataframe

df4.columns

Index(['first', 'last', 'age', 'physical_strength', 'mental_acuity', 'height',
       'person_type', 'alive'],
      dtype='object')

In [366]:
# Before we calculate any aggregate values, let's first ensure that the datatype of the numerical values are float

df4[['age','physical_strength', 'mental_acuity', 'height']] = df4[['age','physical_strength', 'mental_acuity', 'height']].astype(float)

In [367]:
# Now we can use describe to get a sense of the data

df4.describe()

             age  physical_strength  mental_acuity      height
count   6.000000           6.000000       6.000000    6.000000
mean   46.000000          58.000000      80.833333  182.000000
std    10.807405          29.017236      12.416387    6.752777
min    35.000000          20.000000      60.000000  175.000000
25%    37.750000          37.500000      76.250000  177.250000
50%    43.000000          57.500000      82.500000  180.500000
75%    54.250000          83.500000      88.750000  185.250000
max    61.000000          90.000000      95.000000  193.000000

In [368]:
# You can also calculate the mean, median, etc. of specific columns

df4['age'].median()

43.0

In [369]:
df4['height'].mean()

182.0

In [370]:
# You can also sort by a specific column

df4.sort_values(by = 'height')

,first,last,age,physical_strength,mental_acuity,height,person_type,alive
5,Saul,Goodman,57.0,35.0,90.0,175.0,Human,Yes
3,Endeavour,Morse,40.0,20.0,95.0,177.0,Human,No
1,Diana,Prince,35.0,88.0,80.0,178.0,Super,Yes
2,Bruce,Wayne,46.0,70.0,85.0,183.0,Super,Yes
4,Tony,Soprano,61.0,45.0,60.0,186.0,Human,No
0,Clark,Kent,37.0,90.0,75.0,193.0,Super,Yes

In [371]:
# value_count gives you the frequency distribution of values for a specific column

df4['person_type'].value_counts()

Human    3
Super    3
Name: person_type, dtype: int64

In [372]:
# similarly, for another label/ column

df4['alive'].value_counts()

Yes    4
No     2
Name: alive, dtype: int64

In [373]:
# Now suppose you want to do the same analysis a level deeper, i.e. get the count of personalities alive, but within superheroes and humans
# In order to calculate such aggregate values, you will first need to group the entries by the desired label, in this case 'person_type'

person_group = df4.groupby(['person_type'])

# this basically creates a division between the entries as per the different entries in 'person_type'. i.e. between 'supers' and 'humans'; now we can use various functions on these groups.

In [376]:
# Let's look at the folks alive by the type of person

person_group['alive'].value_counts()

person_type  alive
Human        No       2
             Yes      1
Super        Yes      3
Name: alive, dtype: int64

In [ ]:
# Above tells you that of the 3 humans, 2 are dead. For superheroes, all are alive

In [375]:
person_group['height'].median()

person_type
Human    177.0
Super    183.0
Name: height, dtype: float64

In [377]:
# Above tells you that on the average, a human is shorter than a superhero by around 6 cms. :(
# You can also access the median of a specific group by calling referring to it by bracket notation

person_group['height'].median().loc['Human']

177.0